CFD_UC/UC_3/0.org/U
/*--------------------------------*- C++ -*----------------------------------*\n| =========                 |                                                 |
| \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \    /   O peration     | Version:  2.2.0                                 |
|   \  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \/     M anipulation  |                                                 |
*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    ".*"
    {
        type            fixedValue;
        value          uniform (0 0 0);
    }

    "proc.*"
    {
        type            processor;
        value 		uniform (0 0 0);
    }

    GEO_inlet
    {
        //type        		flowRateInletVelocity;
        //volumetricFlowRate 	0.0691563; // m3/s --> 5kg/min with rho = 1.205 kg/m3
	type fixedValue;
        value       		uniform (0 0 3.56);
    }
    GEO_outlet
    {
	type fixedValue;
        value       		uniform (0 0 3.56);
    }
    GEO_pressure_reference
    {
	type inletOutlet;
        inletValue       		uniform (0 0 0);
        value       		uniform (0 0 0);
    }
}

// ************************************************************************* //
