CFD_UC/UC_3/0.org/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 2 -2 0 0 0 0 ];

internalField   uniform 0.496;

boundaryField
{
    ".*"
    {
        type            kqRWallFunction;
        value           uniform 0.496;
    }


    "proc.*"
    {
        type            processor;
    }

   GEO_inlet
    {
        type            fixedValue;
        value           uniform 0.0106652048883;
    }

    GEO_outlet
    {
        type            inletOutlet;
        inletValue      uniform 0.0106652048883;
        value           uniform 0.0106652048883;
    }
    GEO_pressure_reference
    {
        type            inletOutlet;
        inletValue      uniform 0.0106652048883;
        value           uniform 0.0106652048883;
    }
}


// ************************************************************************* //
