CFD_UC/UC_3/system/minMax
minMax
{
type fieldMinMax;
functionObjectLibs ( "libfieldFunctionObjects.so");
enabled true;
log true;
write false;
fields ( U p );
}
